In [128]:
%load_ext autoreload
%autoreload 2

# Importing necessary libraries and the functions from the provided file
import pandas as pd
from shuffle_sample import column_shuffle_df, row_shuffle_df, sample_df, get_permutations

# Create DataFrame
data = {
    'int': [1, 2, 3, 4, 5],
    'str': ['apple', 'pear', 'grape', 'kiwi', 'lime'],
    'duplicates': ['dog', 'cat', 'bird', 'cat', 'dog']
}

df = pd.DataFrame(data)

df

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
2    3  grape       bird
3    4   kiwi        cat
4    5   lime        dog

In [129]:
column_shuffle_tables, perms  = column_shuffle_df(df, 10)
# The first table will be the original table
column_shuffle_tables[0]

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
2    3  grape       bird
3    4   kiwi        cat
4    5   lime        dog

In [130]:
column_shuffle_tables[1]

     str duplicates  int
0  apple        dog    1
1   pear        cat    2
2  grape       bird    3
3   kiwi        cat    4
4   lime        dog    5

In [131]:
row_shuffle_tables = row_shuffle_df(df, 10)
row_shuffle_tables[1]

   int    str duplicates
1    2   pear        cat
4    5   lime        dog
2    3  grape       bird
3    4   kiwi        cat
0    1  apple        dog

In [132]:
sample_tables = sample_df(df, 10 , 0.5)
sample_tables[1]

   int   str duplicates
1    2  pear        cat
4    5  lime        dog

In [133]:
sample_tables[0]

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
2    3  grape       bird
3    4   kiwi        cat
4    5   lime        dog

In [134]:
from single_table_processing import get_most_similar_rows
text_to_compare = "My dog loves to eat pear"
similar_rows = get_most_similar_rows(df, text_to_compare, k = 3)
similar_rows

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
4    5   lime        dog

In [135]:

from single_table_processing import get_most_similar_rows


text_to_compare = "My dog loves to eat pear"
similar_rows = get_most_similar_rows(df, text_to_compare)
print(similar_rows)

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
4    5   lime        dog
2    3  grape       bird
3    4   kiwi        cat

In [136]:
similar_rows = get_most_similar_rows(df, text_to_compare, k = 3)
similar_rows

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
4    5   lime        dog

In [137]:
from single_table_processing import get_most_similar_cols
text_to_compare = "My cat loves to eat pear"
similar_cols = get_most_similar_cols(df, text_to_compare)
similar_cols

  duplicates    str  int
0        dog  apple    1
1        cat   pear    2
2       bird  grape    3
3        cat   kiwi    4
4        dog   lime    5

In [138]:
df

   int    str duplicates
0    1  apple        dog
1    2   pear        cat
2    3  grape       bird
3    4   kiwi        cat
4    5   lime        dog

In [144]:
from single_table_processing import rank_rows_by_tfidf

rank_rows_by_tfidf(df)

   int    str duplicates
2    3  grape       bird
0    1  apple        dog
1    2   pear        cat
3    4   kiwi        cat
4    5   lime        dog